In [1]:
import pandas as pd

df = pd.read_csv("Titanic.csv")

In [8]:
df

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1
...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0
1312,"Zimmerman, Leo",3rd,29.00,male,0

In [12]:
average_age = df["Age"].fillna(21).mean()
round(average_age, 3)

26.411

In [11]:
average_name_length = df["Name"].apply(len).mean()
round(average_name_length, 3)

23.527

In [15]:
underage_median = df[df["Age"] < 18]["Age"].median()
round(underage_median, 3)

9.0

In [44]:
average_age_first_class_women = df[(df["PClass"] == "1st") & (df["Sex"] == "female")][
    "Age"
].mean()
average_age_first_class_women

32.84615384615385

In [47]:
youngest_survived_male = (
    df[(df["Survived"] == 1) & (df["Sex"] == "male")].sort_values("Age").iloc[0]
)
youngest_survived_male["Name"]

'Richards, Master George Sidney'